profiling_results/stage-3_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.297ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.039ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.00ms    1.68ms  34.40ms   94.09%
    Req/Sec   530.53    129.07     1.50k    74.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.70ms
 75.000%    2.26ms
 90.000%    2.97ms
 99.000%    8.86ms
 99.900%   23.06ms
 99.990%   31.31ms
 99.999%   34.43ms
100.000%   34.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.237     0.000000            1         0.00
       0.883     0.100000         4998 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.107     0.200000        10003         0.00
       1.313     0.300000        15005        -0.00
       1.511     0.400000        19994        -0.00
       1.697     0.500000        24989         0.00
       1.789     0.550000        27491 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.888     0.600000        29988         0.00
       1.998     0.650000        32485        -0.00
       2.119     0.700000        34980        -0.00
       2.257     0.750000        37484         0.00
       2.337     0.775000        38750 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.421     0.800000        39999         0.00
       2.519     0.825000        41231        -0.00
       2.641     0.850000        42487        -0.00
       2.783     0.875000        43726         0.00
       2.875     0.887500        44360 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       2.973     0.900000        44975         0.00
       3.107     0.912500        45605        -0.00
       3.293     0.925000        46224        -0.00
       3.585     0.937500        46848         0.00
       3.771     0.943750        47164 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.027     0.950000        47474         -nan
       4.331     0.956250        47788        -0.00
       4.767     0.962500        48098        -0.00
       5.375     0.968750        48410         0.00
       5.727     0.971875        48568 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       6.103     0.975000        48723         -nan
       6.491     0.978125        48880        -0.00
       6.951     0.981250        49035        -0.00
       7.531     0.984375        49194         0.00
       7.863     0.985938        49269 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       8.247     0.987500        49348         0.00
       8.647     0.989062        49426        -0.00
       9.055     0.990625        49503        -0.00
       9.615     0.992188        49581         0.00
       9.951     0.992969        49621 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      10.311     0.993750        49661         0.00
      10.703     0.994531        49698        -0.00
      11.215     0.995313        49737        -0.00
      11.887     0.996094        49776         0.00
      12.151     0.996484        49796 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      12.759     0.996875        49815         -nan
      13.703     0.997266        49835        -0.00
      15.399     0.997656        49854        -0.00
      16.751     0.998047        49874         0.00
      17.679     0.998242        49884 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      18.671     0.998437        49893         -nan
      20.143     0.998633        49903        -0.00
      21.951     0.998828        49913        -0.00
      23.551     0.999023        49923         0.00
      24.399     0.999121        49928 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      24.847     0.999219        49932         0.00
      25.823     0.999316        49937        -0.00
      26.671     0.999414        49942        -0.00
      27.999     0.999512        49947         0.00
      28.383     0.999561        49950 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      28.703     0.999609        49952         0.00
      29.071     0.999658        49954        -0.00
      29.279     0.999707        49957        -0.00
      29.759     0.999756        49959         0.00
      30.383     0.999780        49961 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      30.415     0.999805        49962         -nan
      30.767     0.999829        49963        -0.00
      31.247     0.999854        49964        -0.00
      31.263     0.999878        49965         0.00
      31.311     0.999890        49966 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      31.823     0.999902        49967         -nan
      31.823     0.999915        49967        -0.00
      32.447     0.999927        49968        -0.00
      32.447     0.999939        49968         0.00
      33.279     0.999945        49969 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      33.279     0.999951        49969         0.00
      33.279     0.999957        49969        -0.00
      34.015     0.999963        49970        -0.00
      34.015     0.999969        49970         0.00
      34.015     0.999973        49970 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      34.015     0.999976        49970         0.00
      34.015     0.999979        49970        -0.00
      34.431     0.999982        49971        -0.00
      34.431     1.000000        49971         0.00
#[Mean    =        2.000, StdDeviation   =        1.681]
#[Max     =       34.400, Total count    =        49971]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59992 requests in 1.00m, 4.14MB read
  Non-2xx or 3xx responses: 15
Requests/sec:    999.91
Transfer/sec:     70.59KB